In [ ]:
two daatpes-
series
dataframe

#pip install pandas----in anaconda prompt
!pip install pandas -----in jupyter notebook

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.0.5

## Series

In [5]:
l=[1,2,3,4]
Ser=pd.Series(l)

In [6]:
Ser

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
type(l)

list

In [8]:
type(Ser)

pandas.core.series.Series

In [9]:
pd.Series(l,index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
d={'a':1,'b':2,'c':3,'d':4}

In [11]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [12]:
type(d)

dict

In [13]:
pd.Series(d)

a    1
b    2
c    3
d    4
dtype: int64

In [16]:
#Task:
Marks={"maths":34,"che":45,"social":34,"physics":67}
ser=pd.Series(Marks,index=['maths','che','physics'])

In [17]:
ser

maths      34
che        45
physics    67
dtype: int64

### Series indexing

In [18]:
ser[1]

45

In [19]:
ser["che"]

45

In [20]:
#Series slicing

ser[1:3]

che        45
physics    67
dtype: int64

In [21]:
ser[:2]

maths    34
che      45
dtype: int64

In [22]:
ser.shape

(3,)

In [23]:
type(ser)

pandas.core.series.Series

### Dataframe

In [24]:
list=[1,2,3,4],[5,6,7,8],[9,1,11,12],[13,14,15,16]
columns=["a","b","c","d"]
labels=["A","B","C","D"]

In [26]:
df=pd.DataFrame(list,index=labels,columns=columns)

In [27]:
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9   1  11  12
D  13  14  15  16

In [30]:
df=pd.DataFrame({"name":['x','y','z'],"age":[12,13,14],"branch":["ML","DL","AI"]})

In [31]:
df

  name  age branch
0    x   12     ML
1    y   13     DL
2    z   14     AI

In [32]:
type(df)

pandas.core.frame.DataFrame

In [33]:
df.shape

(3, 3)

In [34]:
df.columns

Index(['name', 'age', 'branch'], dtype='object')

In [35]:
df1=df.rename(columns={"name":"new_name"})

In [36]:
df1

  new_name  age branch
0        x   12     ML
1        y   13     DL
2        z   14     AI

In [37]:
df.columns.values

array(['name', 'age', 'branch'], dtype=object)

In [38]:
df

  name  age branch
0    x   12     ML
1    y   13     DL
2    z   14     AI

In [40]:
df.drop("name",axis=1)
#axis=1 --columns
#axis=0 ---rows

   age branch
0   12     ML
1   13     DL
2   14     AI

In [41]:
df

  name  age branch
0    x   12     ML
1    y   13     DL
2    z   14     AI

In [42]:
df.drop("name",axis=1,inplace=True)
df

   age branch
0   12     ML
1   13     DL
2   14     AI

In [43]:
#add a columns to the same dataframe
df["place"]=['hyd','del','bang']

In [44]:
df

   age branch place
0   12     ML   hyd
1   13     DL   del
2   14     AI  bang

In [47]:
df[["age","branch"]]

   age branch
0   12     ML
1   13     DL
2   14     AI

In [48]:
#concatenate
df2=pd.DataFrame({"name":['x','y','z','a','b','c'],"age":[12,13,14,15,16,17],"branch":["ML","DL","AI","CS","IT","Mech"]
                 ,"place":["delhi","bang","hyd","chennai","kol","mah"]})

In [49]:
df2

  name  age branch    place
0    x   12     ML    delhi
1    y   13     DL     bang
2    z   14     AI      hyd
3    a   15     CS  chennai
4    b   16     IT      kol
5    c   17   Mech      mah

In [50]:
df

   age branch place
0   12     ML   hyd
1   13     DL   del
2   14     AI  bang

In [51]:
df3=df.append(df2)

In [52]:
df3

   age branch    place name
0   12     ML      hyd  NaN
1   13     DL      del  NaN
2   14     AI     bang  NaN
0   12     ML    delhi    x
1   13     DL     bang    y
2   14     AI      hyd    z
3   15     CS  chennai    a
4   16     IT      kol    b
5   17   Mech      mah    c

In [53]:
df3=df.append(df2,ignore_index=True)

In [54]:
df3

   age branch    place name
0   12     ML      hyd  NaN
1   13     DL      del  NaN
2   14     AI     bang  NaN
3   12     ML    delhi    x
4   13     DL     bang    y
5   14     AI      hyd    z
6   15     CS  chennai    a
7   16     IT      kol    b
8   17   Mech      mah    c

In [ ]:
#handling missing values
1.deleting rows
10,000----2 rows
10----2 rows--not correct option
2.delete the columns with null values
if required column--not a good option
if it contains 70-80% o null vlaues---yes 
3.replacing with mean,median,mode
mean  1 2 3 4 5------1+2+3+4+5/5 =
median 1 2 3 4 5-----3
mode dl ml dl ml dl--high frequency--dl

In [61]:
import numpy as np
df2=pd.DataFrame({"name":['tulsi','vanieka',np.nan,'rachita','tulsi',np.nan],"age":[np.nan,13,14,np.nan,16,17],"branch":["ML","DL",np.nan,"DL","IT",np.nan]
                 ,"place":["delhi","bang","hyd","chennai","kol","mah"]})

In [62]:
df2

      name   age branch    place
0    tulsi   NaN     ML    delhi
1  vanieka  13.0     DL     bang
2      NaN  14.0    NaN      hyd
3  rachita   NaN     DL  chennai
4    tulsi  16.0     IT      kol
5      NaN  17.0    NaN      mah

In [63]:
df2.shape

(6, 4)

In [64]:
df2.isnull()

    name    age  branch  place
0  False   True   False  False
1  False  False   False  False
2   True  False    True  False
3  False   True   False  False
4  False  False   False  False
5   True  False    True  False

In [65]:
df2.isnull().any()

name       True
age        True
branch     True
place     False
dtype: bool

In [66]:
df2.isnull().sum()

name      2
age       2
branch    2
place     0
dtype: int64

In [69]:
df2.dropna(inplace=True)

In [70]:
df2

      name   age branch place
1  vanieka  13.0     DL  bang
4    tulsi  16.0     IT   kol

In [71]:
import numpy as np
df2=pd.DataFrame({"name":['tulsi','vanieka',np.nan,'rachita','tulsi',np.nan],"age":[np.nan,13,14,np.nan,16,17],"branch":["ML","DL",np.nan,"DL","IT",np.nan]
                 ,"place":["delhi","bang","hyd","chennai","kol","mah"]})

In [72]:
df2

      name   age branch    place
0    tulsi   NaN     ML    delhi
1  vanieka  13.0     DL     bang
2      NaN  14.0    NaN      hyd
3  rachita   NaN     DL  chennai
4    tulsi  16.0     IT      kol
5      NaN  17.0    NaN      mah

In [73]:
df2.dropna(axis=1,inplace=True)

In [74]:
df2

     place
0    delhi
1     bang
2      hyd
3  chennai
4      kol
5      mah

In [75]:
import numpy as np
df2=pd.DataFrame({"name":['tulsi','vanieka',np.nan,'rachita','tulsi',np.nan],"age":[np.nan,13,14,np.nan,16,17],"branch":["ML","DL",np.nan,"DL","IT",np.nan]
                 ,"place":["delhi","bang","hyd","chennai","kol","mah"]})

In [76]:
df2

      name   age branch    place
0    tulsi   NaN     ML    delhi
1  vanieka  13.0     DL     bang
2      NaN  14.0    NaN      hyd
3  rachita   NaN     DL  chennai
4    tulsi  16.0     IT      kol
5      NaN  17.0    NaN      mah

In [82]:
df2["age"]=df2["age"].fillna(df2["age"].mean())

In [78]:
df2["age"].mean()

15.0

In [79]:
13+14+16+17

60

In [80]:
60/4

15.0

In [83]:
df2

      name   age branch    place
0    tulsi  15.0     ML    delhi
1  vanieka  13.0     DL     bang
2      NaN  14.0    NaN      hyd
3  rachita  15.0     DL  chennai
4    tulsi  16.0     IT      kol
5      NaN  17.0    NaN      mah

In [90]:
df2["name"]=df2["name"].fillna(df2["name"].mode()[0])

tulsi 3
vanieka 2
rachita 1

mode function
0 tulsi
1 vanieka

In [92]:
df2["name"].mode()[0]

'tulsi'

In [93]:
df2

      name   age branch    place
0    tulsi  15.0     ML    delhi
1  vanieka  13.0     DL     bang
2    tulsi  14.0    NaN      hyd
3  rachita  15.0     DL  chennai
4    tulsi  16.0     IT      kol
5    tulsi  17.0    NaN      mah

In [94]:
#Task: replace null values in branch column
df2["branch"]=df2["branch"].fillna(df2["branch"].mode()[0])

In [95]:
df2

      name   age branch    place
0    tulsi  15.0     ML    delhi
1  vanieka  13.0     DL     bang
2    tulsi  14.0     DL      hyd
3  rachita  15.0     DL  chennai
4    tulsi  16.0     IT      kol
5    tulsi  17.0     DL      mah

In [96]:
df2.describe()

             age
count   6.000000
mean   15.000000
std     1.414214
min    13.000000
25%    14.250000
50%    15.000000
75%    15.750000
max    17.000000

In [97]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      float64
 2   branch  6 non-null      object
 3   place   6 non-null      object
dtypes: float64(1), object(3)
memory usage: 320.0+ bytes

In [99]:
df2.drop(["name","place"],axis=1,inplace=True)# deleting columns

In [104]:
df2.drop(0,axis=0) #deleting rows

    age branch
1  13.0     DL
2  14.0     DL
3  15.0     DL
4  16.0     IT
5  17.0     DL

In [105]:
df2

    age branch
0  15.0     ML
1  13.0     DL
2  14.0     DL
3  15.0     DL
4  16.0     IT
5  17.0     DL

In [106]:
df2.head()

    age branch
0  15.0     ML
1  13.0     DL
2  14.0     DL
3  15.0     DL
4  16.0     IT

In [107]:
df2.tail()

    age branch
1  13.0     DL
2  14.0     DL
3  15.0     DL
4  16.0     IT
5  17.0     DL

In [108]:
import numpy as np
df2=pd.DataFrame({"name":['tulsi','vanieka',"saanvi",'rachita','tulsi',"venky"],"age":[12,13,14,33,16,17],"branch":["ML","DL","DL","DL","IT","DL"]
                 ,"place":["delhi","bang","hyd","chennai","kol","mah"]})

In [109]:
df2

      name  age branch    place
0    tulsi   12     ML    delhi
1  vanieka   13     DL     bang
2   saanvi   14     DL      hyd
3  rachita   33     DL  chennai
4    tulsi   16     IT      kol
5    venky   17     DL      mah

In [112]:
print(df2.loc[[0,2]])

     name  age branch  place
0   tulsi   12     ML  delhi
2  saanvi   14     DL    hyd

In [114]:
print(df2.loc[0:2])

      name  age branch  place
0    tulsi   12     ML  delhi
1  vanieka   13     DL   bang
2   saanvi   14     DL    hyd

In [115]:
data={"calories":[420,524,561],"duration":[50,40,45]}
df=pd.DataFrame(data,index=["day1","day2","day3"])

In [116]:
df

      calories  duration
day1       420        50
day2       524        40
day3       561        45

In [117]:
print(df.loc["day2"])

calories    524
duration     40
Name: day2, dtype: int64

In [ ]:
loc --label based---accessing the rows

In [ ]:
iloc--index based---accessing rows and columns

In [118]:
df2

      name  age branch    place
0    tulsi   12     ML    delhi
1  vanieka   13     DL     bang
2   saanvi   14     DL      hyd
3  rachita   33     DL  chennai
4    tulsi   16     IT      kol
5    venky   17     DL      mah

In [119]:
df2.iloc[1:3,0:3]

      name  age branch
1  vanieka   13     DL
2   saanvi   14     DL

In [121]:
df2.iloc[4:,1:]

   age branch place
4   16     IT   kol
5   17     DL   mah

In [122]:
df2.iloc[:1,:1]

    name
0  tulsi

In [125]:
#all rows in 1 st column
df2.iloc[:,:1]

      name
0    tulsi
1  vanieka
2   saanvi
3  rachita
4    tulsi
5    venky

In [ ]:
#dataframe to numpy array

In [127]:
df2.loc[:,:].values

array([['tulsi', 12, 'ML', 'delhi'],
       ['vanieka', 13, 'DL', 'bang'],
       ['saanvi', 14, 'DL', 'hyd'],
       ['rachita', 33, 'DL', 'chennai'],
       ['tulsi', 16, 'IT', 'kol'],
       ['venky', 17, 'DL', 'mah']], dtype=object)